app/Http/Controllers/MenuController.php

select `id`, `nombre`, `precio`, `imagen_producto`, `descripcion` from `products` where `category_id` = 2 and `status` = 1 and `products`.`deleted_at` is null
select `id`, `nombre`, `precio`, `imagen_producto`, `descripcion` from `products` where `category_id` = 3 and `status` = 1 and `products`.`deleted_at` is null
select `id`, `nombre`, `precio`, `imagen_producto`, `descripcion` from `products` where `category_id` = 4 and `status` = 1 and `products`.`deleted_at` is null
---
    public function mostrar()
    {
        // $productosAntojitos = Product::select('nombre', 'precio', 'imagen_producto', 'descripcion')
        //                            ->where('category_id',1)->get();

        $productosSopas = Product::select('id','nombre', 'precio', 'imagen_producto', 'descripcion')
                                   ->where('category_id',2)
                                   ->where('status', 1)->get();

        $productosEnsaladas = Product::select('id','nombre', 'precio', 'imagen_producto', 'descripcion')
                                   ->where('category_id',3)
                                   ->where('status', 1)->get();


        $productosAntojitos = Product::select('id','nombre', 'precio', 'imagen_producto', 'descripcion')
                                   ->where('category_id',4)
                                   ->where('status', 1)->get();