app/Http/Controllers/Admin/ProductController.php

select * from `products` where `products`.`deleted_at` is null
---
    public function index()
    {

        $productos  = Product::all();

select * from `categories` where `categories`.`deleted_at` is null
---
    public function create()
    {
        $categorias = Category::all();

insert into `products` (`status`, `nombre`, `slug`, `category_id`, `descuento`, `indescuento`, `codigo_producto`, `descripcion`, `user_id`, `imagen_producto`, `updated_at`, `created_at`) values ('1', 'Torta de cochinita', 'torta-de-cochinita', '4', '0', '0', 'NUA7GV', 'Esto es una prueba', 1, 'torta_cochinita.jpg', '2021-11-11 14:06:03', '2021-11-11 14:06:03')
---
    public function store(ProductRequest $request)

    {
        $producto = new Product();
        $producto->status = '1';
        $producto->nombre = $request->nombre;
        $producto->slug = Str::slug($request->nombre);
        $producto->category_id = $request->input('categoria') ?: null;
        // $producto->precio = $request->precio;
        $producto->descuento = $request->descuento;
        $producto->indescuento = $request->en_descuento;
        // $producto->cantidad = $request->cantidad;
        $producto->codigo_producto = $request->código_producto;
        $producto->descripcion = $request->descripcion;
        $producto->user_id = auth()->user()->id;


        if ($archivo = $request->file('imagen')) {
            $nombre_imagen = $archivo->getClientOriginalName();
            $ruta = public_path('img/products/');
            $archivo->move($ruta, $nombre_imagen);
            $producto['imagen_producto'] = $nombre_imagen;
        }

        // dd($producto);


        if ($producto->save()) {

select * from `categories` where `categories`.`deleted_at` is null
---
    public function edit($id)
    {
        $categorias = Category::all();

update `products` set `deleted_at` = '2021-11-11 13:35:25', `products`.`updated_at` = '2021-11-11 13:35:25' where `id` = 2
---
    public function delete($id)
    {
        $producto = Product::findOrFail($id);
        if ($producto->delete()) {

select * from `products` where `products`.`deleted_at` is not null
---
    public function indexDelete()
    {

        $productos = Product::onlyTrashed()->get();

insert into `product_inventaries` (`product_id`, `nombre`, `cantidad_inventario`, `precio`, `limitado_inventario`, `inventario_minimo`, `updated_at`, `created_at`) values ('1', 'Pollo', '1', '48', '0', '1', '2021-11-11 13:49:06', '2021-11-11 13:49:06')
---
    public function storeProductInventary(Request $request, $id)
    {

        $productInventary = new ProductInventary();

        $request->validate([
            'nombre'               => 'required|max:30',
            'cantidad'             => 'min:1|required',
            'precio'               => 'required',
            'limitado'             => 'required',
            'minimo'               => 'required',
        ]);

        $productInventary->product_id = $id;
        $productInventary->nombre = $request->nombre;
        $productInventary->cantidad_inventario = $request->cantidad;
        $productInventary->precio = $request->precio;
        $productInventary->limitado_inventario = $request->limitado;
        $productInventary->inventario_minimo = $request->minimo;
        // $productInventary->save();

        // dd($productInventary);
        if ($productInventary->save()) {

select * from `product_inventaries` where `product_inventaries`.`deleted_at` is not null
update `product_inventaries` set `deleted_at` = '2021-11-11 13:35:59', `product_inventaries`.`updated_at` = '2021-11-11 13:35:59' where `id` = 3
---
    public function deleteProductInventary($id)
    {
        $inventario = ProductInventary::findOrFail($id);
        //Hacer una condicion
        if ($inventario->delete()) {

select * from `product_inventaries` where `product_inventaries`.`deleted_at` is not null and `product_inventaries`.`id` = '3' limit 1
update `product_inventaries` set `deleted_at` = '', `product_inventaries`.`updated_at` = '2021-11-11 13:37:42' where `id` = 3
---
    public function inventarioRestore($id)
    {

        $inventario = ProductInventary::find($id);
        ProductInventary::onlyTrashed()->findOrFail($id)->restore();

update `products` set `precio` = '65.00', `products`.`updated_at` = '2021-11-11 13:45:03' where `id` = 2
---
    public function getUpdateMinPrecio($id)
    {
        $producto = Product::find($id);
        $precio = $producto->getPrice->min('precio');
        $producto->precio = $precio;
        $producto->save();